app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @song = Song.new
    if Artist.exists?(params[:artist_id])
      @song.artist = Artist.find(params[:artist_id])

SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    #binding.pry
    if !params[:artist_id].nil?
      if !Artist.exists?(params[:artist_id])
        redirect_to artists_path
      else
        @artist = Artist.find_by(id: params[:artist_id])
      end
    end
    if !Song.exists?(params[:id])
      redirect_to artist_songs_path(@artist)
    else
      @song = Song.find(params[:id])